Python 3.7.2 (tags/v3.7.2:9a3ffc0492, Dec 23 2018, 22:20:52) [MSC v.1916 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
=============== RESTART: C:\Users\Irain\Desktop\贝叶斯算法\Beyes.py ===============
>>> bys = Bayes()
>>> train_data, labels = traindata()
---------------------------------------- 开始加载数据 -----------------------------------
文件存储相对路径：train_digital_pictures/
所有训练txt文本数量: 6600
统计有用数据数量 : 6600
---------------------------------------- 结束加载数据 -----------------------------------

>>> bys.fit(train_data,labels)
---------------------------------------- 开始训练数据 -----------------------------------
类别0所占比例0.1
类别1所占比例0.1
类别2所占比例0.1
类别3所占比例0.1
类别4所占比例0.1
类别5所占比例0.1
类别6所占比例0.1
类别7所占比例0.1
类别8所占比例0.1
类别9所占比例0.1
---------------------------------------- 数据训练结束 -----------------------------------

<__main__.Bayes object at 0x02B31550>
>>> bys.testdata()
---------------------------------------- 开始测试数据 -----------------------------------
文件存储相对路径：test_digital_txt/
所有测试txt文本数量: 2200

---------------------------------------- 类别 0 ----------------------------------------

0_661.txt样本预测出错： 8
0_666.txt样本预测出错： 6
0_674.txt样本预测出错： 5
0_678.txt样本预测出错： 5
0_682.txt样本预测出错： 5
0_684.txt样本预测出错： 5
0_685.txt样本预测出错： 8
0_691.txt样本预测出错： 6
0_705.txt样本预测出错： 6
0_709.txt样本预测出错： 8
0_712.txt样本预测出错： 5
0_718.txt样本预测出错： 4
0_719.txt样本预测出错： 6
0_723.txt样本预测出错： 5
0_726.txt样本预测出错： 2
0_727.txt样本预测出错： 2
0_729.txt样本预测出错： 5
0_804.txt样本预测出错： 4
0_807.txt样本预测出错： 6
0_819.txt样本预测出错： 6
0_866.txt样本预测出错： 6
0_879.txt样本预测出错： 4
数字0出错情况：出错次数22、出错率1.0%、错判次数最多的数字6

---------------------------------------- 类别 1 ----------------------------------------

1_690.txt样本预测出错： 5
1_696.txt样本预测出错： 8
1_702.txt样本预测出错： 7
1_731.txt样本预测出错： 2
1_754.txt样本预测出错： 2
1_755.txt样本预测出错： 8
1_761.txt样本预测出错： 2
1_762.txt样本预测出错： 2
1_764.txt样本预测出错： 2
1_768.txt样本预测出错： 2
1_769.txt样本预测出错： 2
1_770.txt样本预测出错： 2
1_773.txt样本预测出错： 2
1_774.txt样本预测出错： 8
1_783.txt样本预测出错： 6
1_805.txt样本预测出错： 2
1_823.txt样本预测出错： 2
1_841.txt样本预测出错： 2
1_844.txt样本预测出错： 8
1_846.txt样本预测出错： 8
1_847.txt样本预测出错： 2
1_849.txt样本预测出错： 2
1_854.txt样本预测出错： 2
1_856.txt样本预测出错： 2
1_874.txt样本预测出错： 8
数字1出错情况：出错次数25、出错率1.1%、错判次数最多的数字2

---------------------------------------- 类别 2 ----------------------------------------

2_674.txt样本预测出错： 0
2_678.txt样本预测出错： 6
2_684.txt样本预测出错： 0
2_690.txt样本预测出错： 0
2_703.txt样本预测出错： 4
2_705.txt样本预测出错： 4
2_708.txt样本预测出错： 4
2_709.txt样本预测出错： 6
2_720.txt样本预测出错： 6
2_721.txt样本预测出错： 6
2_722.txt样本预测出错： 6
2_752.txt样本预测出错： 4
2_757.txt样本预测出错： 4
2_776.txt样本预测出错： 5
2_777.txt样本预测出错： 4
2_778.txt样本预测出错： 0
2_782.txt样本预测出错： 7
2_787.txt样本预测出错： 8
2_795.txt样本预测出错： 3
2_798.txt样本预测出错： 3
2_800.txt样本预测出错： 0
2_802.txt样本预测出错： 0
2_805.txt样本预测出错： 6
2_819.txt样本预测出错： 4
2_820.txt样本预测出错： 4
2_821.txt样本预测出错： 4
2_824.txt样本预测出错： 4
2_828.txt样本预测出错： 6
2_835.txt样本预测出错： 6
2_838.txt样本预测出错： 6
2_842.txt样本预测出错： 8
2_843.txt样本预测出错： 8
2_844.txt样本预测出错： 8
2_847.txt样本预测出错： 4
2_852.txt样本预测出错： 4
2_855.txt样本预测出错： 4
2_860.txt样本预测出错： 4
2_861.txt样本预测出错： 6
2_864.txt样本预测出错： 6
2_870.txt样本预测出错： 4
2_871.txt样本预测出错： 4
2_873.txt样本预测出错： 6
数字2出错情况：出错次数42、出错率1.9%、错判次数最多的数字4

---------------------------------------- 类别 3 ----------------------------------------

3_670.txt样本预测出错： 8
3_672.txt样本预测出错： 2
3_675.txt样本预测出错： 2
3_695.txt样本预测出错： 2
3_703.txt样本预测出错： 8
3_704.txt样本预测出错： 0
3_713.txt样本预测出错： 0
3_714.txt样本预测出错： 8
3_715.txt样本预测出错： 7
3_719.txt样本预测出错： 2
3_728.txt样本预测出错： 5
3_730.txt样本预测出错： 0
3_739.txt样本预测出错： 8
3_740.txt样本预测出错： 8
3_741.txt样本预测出错： 8
3_743.txt样本预测出错： 8
3_744.txt样本预测出错： 2
3_749.txt样本预测出错： 5
3_752.txt样本预测出错： 2
3_757.txt样本预测出错： 5
3_764.txt样本预测出错： 8
3_783.txt样本预测出错： 2
3_785.txt样本预测出错： 2
3_786.txt样本预测出错： 2
3_790.txt样本预测出错： 2
3_791.txt样本预测出错： 2
3_793.txt样本预测出错： 2
3_803.txt样本预测出错： 2
3_807.txt样本预测出错： 2
3_811.txt样本预测出错： 8
3_812.txt样本预测出错： 8
3_817.txt样本预测出错： 5
3_821.txt样本预测出错： 5
3_826.txt样本预测出错： 8
3_830.txt样本预测出错： 8
3_831.txt样本预测出错： 5
3_833.txt样本预测出错： 5
3_834.txt样本预测出错： 8
3_844.txt样本预测出错： 0
3_849.txt样本预测出错： 5
3_865.txt样本预测出错： 8
3_873.txt样本预测出错： 8
数字3出错情况：出错次数42、出错率1.9%、错判次数最多的数字8

---------------------------------------- 类别 4 ----------------------------------------

4_661.txt样本预测出错： 5
4_676.txt样本预测出错： 8
4_677.txt样本预测出错： 5
4_685.txt样本预测出错： 9
4_686.txt样本预测出错： 6
4_696.txt样本预测出错： 8
4_698.txt样本预测出错： 8
4_715.txt样本预测出错： 8
4_724.txt样本预测出错： 9
4_726.txt样本预测出错： 9
4_729.txt样本预测出错： 8
4_730.txt样本预测出错： 8
4_732.txt样本预测出错： 8
4_734.txt样本预测出错： 8
4_735.txt样本预测出错： 8
4_736.txt样本预测出错： 8
4_737.txt样本预测出错： 8
4_738.txt样本预测出错： 5
4_739.txt样本预测出错： 5
4_741.txt样本预测出错： 8
4_744.txt样本预测出错： 8
4_746.txt样本预测出错： 8
4_748.txt样本预测出错： 8
4_767.txt样本预测出错： 8
4_771.txt样本预测出错： 9
4_786.txt样本预测出错： 8
4_794.txt样本预测出错： 9
4_795.txt样本预测出错： 9
4_796.txt样本预测出错： 6
4_798.txt样本预测出错： 8
4_805.txt样本预测出错： 5
4_817.txt样本预测出错： 8
4_821.txt样本预测出错： 8
4_832.txt样本预测出错： 9
4_842.txt样本预测出错： 9
4_843.txt样本预测出错： 9
4_850.txt样本预测出错： 9
4_852.txt样本预测出错： 9
数字4出错情况：出错次数38、出错率1.7%、错判次数最多的数字8

---------------------------------------- 类别 5 ----------------------------------------

5_667.txt样本预测出错： 0
5_670.txt样本预测出错： 8
5_671.txt样本预测出错： 4
5_675.txt样本预测出错： 2
5_677.txt样本预测出错： 4
5_679.txt样本预测出错： 4
5_680.txt样本预测出错： 4
5_686.txt样本预测出错： 3
5_687.txt样本预测出错： 3
5_688.txt样本预测出错： 3
5_689.txt样本预测出错： 3
5_692.txt样本预测出错： 3
5_695.txt样本预测出错： 3
5_696.txt样本预测出错： 3
5_704.txt样本预测出错： 2
5_707.txt样本预测出错： 8
5_708.txt样本预测出错： 8
5_709.txt样本预测出错： 6
5_710.txt样本预测出错： 6
5_711.txt样本预测出错： 4
5_712.txt样本预测出错： 4
5_713.txt样本预测出错： 4
5_714.txt样本预测出错： 6
5_735.txt样本预测出错： 4
5_754.txt样本预测出错： 4
5_762.txt样本预测出错： 8
5_765.txt样本预测出错： 0
5_767.txt样本预测出错： 0
5_768.txt样本预测出错： 0
5_771.txt样本预测出错： 0
5_775.txt样本预测出错： 3
5_777.txt样本预测出错： 0
5_807.txt样本预测出错： 8
5_811.txt样本预测出错： 0
5_822.txt样本预测出错： 8
5_824.txt样本预测出错： 8
5_826.txt样本预测出错： 9
5_841.txt样本预测出错： 3
5_843.txt样本预测出错： 3
5_852.txt样本预测出错： 8
5_870.txt样本预测出错： 0
5_871.txt样本预测出错： 6
5_873.txt样本预测出错： 6
5_874.txt样本预测出错： 4
5_876.txt样本预测出错： 4
数字5出错情况：出错次数45、出错率2.0%、错判次数最多的数字4

---------------------------------------- 类别 6 ----------------------------------------

6_664.txt样本预测出错： 5
6_680.txt样本预测出错： 5
6_683.txt样本预测出错： 5
6_741.txt样本预测出错： 0
6_742.txt样本预测出错： 0
6_749.txt样本预测出错： 0
6_750.txt样本预测出错： 5
6_776.txt样本预测出错： 0
6_782.txt样本预测出错： 0
6_789.txt样本预测出错： 0
6_858.txt样本预测出错： 0
数字6出错情况：出错次数11、出错率0.5%、错判次数最多的数字0

---------------------------------------- 类别 7 ----------------------------------------

7_665.txt样本预测出错： 2
7_666.txt样本预测出错： 8
7_672.txt样本预测出错： 9
7_685.txt样本预测出错： 8
7_688.txt样本预测出错： 0
7_689.txt样本预测出错： 8
7_690.txt样本预测出错： 3
7_715.txt样本预测出错： 9
7_744.txt样本预测出错： 9
7_754.txt样本预测出错： 3
7_760.txt样本预测出错： 0
7_799.txt样本预测出错： 8
7_802.txt样本预测出错： 8
7_803.txt样本预测出错： 8
7_805.txt样本预测出错： 8
7_813.txt样本预测出错： 8
7_818.txt样本预测出错： 8
7_820.txt样本预测出错： 8
7_843.txt样本预测出错： 8
7_850.txt样本预测出错： 4
数字7出错情况：出错次数20、出错率0.9%、错判次数最多的数字8

---------------------------------------- 类别 8 ----------------------------------------

8_661.txt样本预测出错： 3
8_662.txt样本预测出错： 5
8_672.txt样本预测出错： 3
8_675.txt样本预测出错： 9
8_687.txt样本预测出错： 3
8_703.txt样本预测出错： 2
8_707.txt样本预测出错： 5
8_708.txt样本预测出错： 5
8_710.txt样本预测出错： 5
8_727.txt样本预测出错： 5
8_728.txt样本预测出错： 5
8_733.txt样本预测出错： 0
8_734.txt样本预测出错： 0
8_736.txt样本预测出错： 5
8_741.txt样本预测出错： 5
8_742.txt样本预测出错： 5
8_751.txt样本预测出错： 3
8_755.txt样本预测出错： 3
8_768.txt样本预测出错： 3
8_777.txt样本预测出错： 7
8_795.txt样本预测出错： 0
8_799.txt样本预测出错： 5
8_807.txt样本预测出错： 5
8_811.txt样本预测出错： 5
8_813.txt样本预测出错： 5
8_814.txt样本预测出错： 5
8_816.txt样本预测出错： 5
8_823.txt样本预测出错： 0
8_824.txt样本预测出错： 6
8_825.txt样本预测出错： 5
8_827.txt样本预测出错： 0
8_828.txt样本预测出错： 0
8_830.txt样本预测出错： 0
8_833.txt样本预测出错： 6
8_835.txt样本预测出错： 0
8_862.txt样本预测出错： 2
数字8出错情况：出错次数36、出错率1.6%、错判次数最多的数字5

---------------------------------------- 类别 9 ----------------------------------------

9_665.txt样本预测出错： 0
9_668.txt样本预测出错： 4
9_671.txt样本预测出错： 5
9_673.txt样本预测出错： 5
9_674.txt样本预测出错： 7
9_678.txt样本预测出错： 4
9_679.txt样本预测出错： 5
9_680.txt样本预测出错： 5
9_681.txt样本预测出错： 7
9_682.txt样本预测出错： 7
9_684.txt样本预测出错： 7
9_687.txt样本预测出错： 7
9_688.txt样本预测出错： 4
9_689.txt样本预测出错： 4
9_690.txt样本预测出错： 0
9_691.txt样本预测出错： 8
9_692.txt样本预测出错： 4
9_694.txt样本预测出错： 4
9_695.txt样本预测出错： 8
9_696.txt样本预测出错： 8
9_703.txt样本预测出错： 7
9_705.txt样本预测出错： 7
9_709.txt样本预测出错： 7
9_711.txt样本预测出错： 7
9_721.txt样本预测出错： 7
9_722.txt样本预测出错： 7
9_723.txt样本预测出错： 7
9_725.txt样本预测出错： 7
9_728.txt样本预测出错： 7
9_729.txt样本预测出错： 7
9_735.txt样本预测出错： 7
9_742.txt样本预测出错： 7
9_753.txt样本预测出错： 7
9_755.txt样本预测出错： 8
9_759.txt样本预测出错： 8
9_760.txt样本预测出错： 5
9_763.txt样本预测出错： 0
9_764.txt样本预测出错： 8
9_765.txt样本预测出错： 7
9_766.txt样本预测出错： 1
9_768.txt样本预测出错： 7
9_770.txt样本预测出错： 7
9_771.txt样本预测出错： 8
9_773.txt样本预测出错： 7
9_775.txt样本预测出错： 8
9_776.txt样本预测出错： 4
9_777.txt样本预测出错： 7
9_779.txt样本预测出错： 7
9_794.txt样本预测出错： 8
9_800.txt样本预测出错： 8
9_803.txt样本预测出错： 8
9_805.txt样本预测出错： 8
9_813.txt样本预测出错： 7
9_814.txt样本预测出错： 7
9_817.txt样本预测出错： 7
9_819.txt样本预测出错： 7
9_823.txt样本预测出错： 7
9_825.txt样本预测出错： 7
9_833.txt样本预测出错： 7
9_836.txt样本预测出错： 0
9_840.txt样本预测出错： 4
9_841.txt样本预测出错： 7
9_846.txt样本预测出错： 7
9_850.txt样本预测出错： 4
9_851.txt样本预测出错： 7
9_853.txt样本预测出错： 7
9_859.txt样本预测出错： 7
9_860.txt样本预测出错： 4
数字9出错情况：出错次数68、出错率3.1%、错判次数最多的数字7

---------------------------------------- 类别 10 ----------------------------------------

---------------------------------------- 数据测试结束 -----------------------------------
准确率：84.1%、正确次数：1851
数字0出错情况：出错次数22、出错率1.0%、错判次数最多的数字6
数字1出错情况：出错次数25、出错率1.1%、错判次数最多的数字2
数字2出错情况：出错次数42、出错率1.9%、错判次数最多的数字4
数字3出错情况：出错次数42、出错率1.9%、错判次数最多的数字8
数字4出错情况：出错次数38、出错率1.7%、错判次数最多的数字8
数字5出错情况：出错次数45、出错率2.0%、错判次数最多的数字4
数字6出错情况：出错次数11、出错率0.5%、错判次数最多的数字0
数字7出错情况：出错次数20、出错率0.9%、错判次数最多的数字8
数字8出错情况：出错次数36、出错率1.6%、错判次数最多的数字5
数字9出错情况：出错次数68、出错率3.1%、错判次数最多的数字7
程序运行消耗时间：108.9分
>>> 
